HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEth_regdef.h
/** \\brief  Register 121 - Receive Frame Count for Good Control Frames Frames */
typedef struct _Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits
{
    unsigned int RXCTRLG:32;                /**< \brief [31:0] RXCTRLG (r) */
} Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits;

/** \\brief  Register 101 - Receive Frame Count for CRC Error Frames */
typedef struct _Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits
{
    unsigned int RXCRCERR:32;               /**< \brief [31:0] RXCRCERR (r) */
} Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits;

/** \\brief  Register 117 - Receive Frame Count for FIFO Overflow Frames */
typedef struct _Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits
{
    unsigned int RXFIFOOVFL:32;             /**< \brief [31:0] RXFIFOOVFL (r) */
} Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits;

/** \\brief  Register 96 - Receive Frame Count for Good and Bad Frames */
typedef struct _Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits
{
    unsigned int RXFRMGB:32;                /**< \brief [31:0] RXFRMGB (r) */
} Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits;

/** \\brief  Register 104 - Receive Frame Count for Jabber Error Frames */
typedef struct _Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits
{
    unsigned int RXJABERR:32;               /**< \brief [31:0] RXJABERR (r) */
} Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits;

/** \\brief  Register 114 - Receive Frame Count for Length Error Frames */
typedef struct _Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits
{
    unsigned int RXLENERR:32;               /**< \brief [31:0] RXLENERR (r) */
} Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits;

/** \\brief  Register 100 - Receive Frame Count for Good Multicast Frames */
typedef struct _Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits
{
    unsigned int RXMCASTG:32;               /**< \brief [31:0] RXMCASTG (r) */
} Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits;

/** \\brief  Register 97 - Receive Octet Count for Good and Bad Frames */
typedef struct _Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits
{
    unsigned int RXOCTGB:32;                /**< \brief [31:0] RXOCTGB (r) */
} Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits;

/** \\brief  Register 98 - Receive Octet Count for Good Frames */
typedef struct _Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits
{
    unsigned int RXOCTG:32;                 /**< \brief [31:0] RXOCTG (r) */
} Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits;

/** \\brief  Register 115 - Receive Frame Count for Out of Range Frames */
typedef struct _Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits
{
    unsigned int RXOUTOFRNG:32;             /**< \brief [31:0] RXOUTOFRNG (r) */
} Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits;

/** \\brief  Register 106 - Receive Frame Count for Oversize Frames */
typedef struct _Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits
{
    unsigned int RXOVERSZG:32;              /**< \brief [31:0] RXOVERSZG (r) */
} Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits;

/** \\brief  Register 116 - Receive Frame Count for PAUSE Frames */
typedef struct _Ifx_ETH_RX_PAUSE_FRAMES_Bits
{
    unsigned int RXPAUSEFRM:32;             /**< \brief [31:0] RXPAUSEFRM (r) */
} Ifx_ETH_RX_PAUSE_FRAMES_Bits;

/** \\brief  Register 120 - Receive Frame Count for Receive Error Frames */
typedef struct _Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits
{
    unsigned int RXRCVERR:32;               /**< \brief [31:0] RXRCVERR (r) */
} Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits;

/** \\brief  Register 103 - Receive Frame Count for Runt Error Frames */
typedef struct _Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits
{
    unsigned int RXRUNTERR:32;              /**< \brief [31:0] RXRUNTERR (r) */
} Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits;

/** \\brief  Register 105 - Receive Frame Count for Undersize Frames */
typedef struct _Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits
{
    unsigned int RXUNDERSZG:32;             /**< \brief [31:0] RXUNDERSZG (r) */
} Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits;

/** \\brief  Register 113 - Receive Frame Count for Good Unicast Frames */
typedef struct _Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits
{
    unsigned int RXUCASTG:32;               /**< \brief [31:0] RXUCASTG (r) */
} Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits;

/** \\brief  Register 118 - Receive Frame Count for Good and Bad VLAN Frames */
typedef struct _Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits
{
    unsigned int RXVLANFRGB:32;             /**< \brief [31:0] RXVLANFRGB (r) */
} Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits;

/** \\brief  Register 119 - Receive Frame Count for Watchdog Error Frames */
typedef struct _Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits
{
    unsigned int RXWDGERR:32;               /**< \brief [31:0] RXWDGERR (r) */
} Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits;

/** \\brief  Register 145 - Receive ICMP Error Frame Counter Register */
typedef struct _Ifx_ETH_RXICMP_ERROR_FRAMES_Bits
{
    unsigned int RXICMPERRFRM:32;           /**< \brief [31:0] RXICMPERRFRM (r) */
} Ifx_ETH_RXICMP_ERROR_FRAMES_Bits;

/** \\brief  Register 161 - Receive ICMP Error Octet Counter Register */
typedef struct _Ifx_ETH_RXICMP_ERROR_OCTETS_Bits
{
    unsigned int RXICMPERROCT:32;           /**< \brief [31:0] RXICMPERROCT (r) */
} Ifx_ETH_RXICMP_ERROR_OCTETS_Bits;

/** \\brief  Register 144 - Receive ICMP Good Frame Counter Register */
typedef struct _Ifx_ETH_RXICMP_GOOD_FRAMES_Bits
{
    unsigned int RXICMPGDFRM:32;            /**< \brief [31:0] RXICMPGDFRM (r) */
} Ifx_ETH_RXICMP_GOOD_FRAMES_Bits;

/** \\brief  Register 160 - Receive ICMP Good Octet Counter Register */
typedef struct _Ifx_ETH_RXICMP_GOOD_OCTETS_Bits
{
    unsigned int RXICMPGDOCT:32;            /**< \brief [31:0] RXICMPGDOCT (r) */
} Ifx_ETH_RXICMP_GOOD_OCTETS_Bits;

/** \\brief  Register 135 - Receive IPV4 Fragmented Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits
{
    unsigned int RXIPV4FRAGFRM:32;          /**< \brief [31:0] RXIPV4FRAGFRM (r) */
} Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits;

/** \\brief  Register 151 - Receive IPV4 Fragmented Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits
{
    unsigned int RXIPV4FRAGOCT:32;          /**< \brief [31:0] This field indicates the number of bytes received in fragmented IPv4 datagrams. The value in the IPv4 headers Length field is used to update this counter. (r) */
} Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits;

/** \\brief  Register 132 - Receive IPV4 Good Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits
{
    unsigned int RXIPV4GDFRM:32;            /**< \brief [31:0] RXIPV4GDFRM (r) */
} Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits;

/** \\brief  Register 148 - Receive IPV4 Good Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits
{
    unsigned int RXIPV4GDOCT:32;            /**< \brief [31:0] This field indicates the number of bytes received in good IPv4 datagrams encapsulating TCP, UDP, or ICMP data. The Ethernet header, FCS, pad, or IP pad (r) */
} Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits;

